load_testing/tsung_shopper_actions.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
     <server host="GoodShopping-s-elsayed.eba-kvqpvst9.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="60" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="60" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="60" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="60" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="60" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="60" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="60" unit="second">
      <users arrivalrate="512" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <session name="shopper_actions" type="ts_http" weight="1">
      <request><http method="GET" url="/"></http></request>
      <request><http method="GET" url="/products"></http></request>
      <thinktime value="6" random="true"></thinktime>
      <!-- Add first item to cart -->
      <request><http method="GET" url="/products/1"></http></request>
      <thinktime value="6" random="true"></thinktime>
      <request><http method="POST" url="/carts/new" version="1.1" contents="cart[shopper_id]=1&amp;cart[product_id]=1&amp;cart[quantity]=1"></http></request>
      <request><http method="GET" url="/products"></http></request>
      <!-- Add second item to cart -->
      <thinktime value="6" random="true"></thinktime>
      <request><http method="GET" url="/products/2"></http></request>
      <thinktime value="6" random="true"></thinktime>
      <request><http method="POST" url="/carts/new" version="1.1" contents="cart[shopper_id]=1&amp;cart[product_id]=2&amp;cart[quantity]=1"></http></request>
    </session>
  </sessions>
</tsung>